[
	{
		"id": 1,
		"param": "datagrades",
		"name": "Datagrades v2.0",
		"icon": "/assets/datagrades.svg",
		"description": "This project is the modern adaptation of my Datagrades v1.0. Datagrades 2.0 is designed to be developed using Flutter for cross platform implementations along with Firebase as its authentication and database solution.",
		"fields": ["UI/UX DESIGN", "SOFTWARE ENGINEERING"]
	},
	{
		"id": 2,
		"param": "inteletraf",
		"name": "Inteletraf",
		"icon": "/assets/inteletraf.svg",
		"description": "Inteletraf is a smart traffic system that me and my team developed during our Technoprenuership course in CIT-U. I was the CEO of my team where I led the development of the user interface as well as the engineering aspects of the project including its system architecture and 3D model.",
		"fields": ["UI/UX DESIGN", "3D DESIGN MODEL"]
	},
	{
		"id": 3,
		"param": "cyberclock",
		"name": "CyberClock",
		"icon": "/assets/cyberclock.svg",
		"description": "Cyberclock is a concept IOT smartclock with a software application which I designed recently to practice my skills in design prototyping both in Figma and Autodesk Fusion360.",
		"fields": ["UI/UX DESIGN", "3D DESIGN MODEL"]
	},
	{
		"id": 4,
		"param": "booksynation",
		"name": "BookSyNation",
		"icon": "/assets/bookcine.svg",
		"description": "The BookSyNation app is a vaccination booking system intended for the facilitation of vaccination scheduling. The app was designed to operate on multiple platforms such as Android, iOS, and the Web.",
		"fields": ["SOFTWARE ENGINEERING", "PROJECT MANAGEMENT"]
	},
	{
		"id": 5,
		"param": "whitelist",
		"name": "WhiteList Inc.",
		"icon": "/assets/whitelist.svg",
		"description": "WhiteList is a centralized informational display hub of various rentable locations within Cebu. The website was developed using React-JS, HTML, and CSS along with Firebase as its authentication and database solution.",
		"fields": ["SOFTWARE ENGINEERING", "PROJECT MANAGEMENT"]
	},
	{
		"id": 6,
		"param": "altruwiz",
		"name": "AltruWiz",
		"icon": "/assets/altruwiz.svg",
		"description": "Altruwiz is an ongoing website that we are developing to consolidate community service activities and initiatives. This app helps people and organizations track, create, and promote community events.",
		"fields": ["SOFTWARE ENGINEERING", "PROJECT MANAGEMENT"]
	}
]
